---
kind: property
id: P:Autodesk.Revit.DB.CurveArrArray.Size
source: html/56467dad-3421-943e-6319-636698bb3c85.htm
---
# Autodesk.Revit.DB.CurveArrArray.Size Property

Returns the number of objects that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```